Repository: Clinica-de-fisioterapia/backend-frontend
Catalog: Backend/src/Core/Chronosystem.Application/Resources/Messages.*.resx
Languages: pt_br

# Validation_RequiredField
source: The field {0} is required.
pt_br: O campo {0} é obrigatório.

# Validation_MinLength
source: The field {0} must have at least {1} characters.
pt_br: O campo {0} deve ter pelo menos {1} caracteres.

# Validation_MaxLength
source: The field {0} must have at most {1} characters.
pt_br: O campo {0} deve ter no máximo {1} caracteres.

# Validation_InvalidFormat
source: The format of field {0} is invalid.
pt_br: O formato do campo {0} é inválido.

# Validation_UserId_Required
source: The user ID is required.
pt_br: O ID do usuário é obrigatório.

# Validation_Id_Mismatch
source: The ID provided in the route does not match the ID in the request body.
pt_br: O ID informado na rota não corresponde ao corpo da requisição.

# Validation_Request_Invalid
source: The request object is invalid or empty.
pt_br: O objeto da requisição é inválido ou está vazio.

# Unit_Name_AlreadyExists
source: A unit with this name already exists.
pt_br: Já existe uma unidade com este nome.

source: Unit not found.
pt_br: Unidade não encontrada.

# Unit_Name_Required
source: The unit name is required.
pt_br: O nome da unidade é obrigatório.

# Unit_Name_MinLength
source: The unit name must have at least 3 characters.
pt_br: O nome da unidade deve ter pelo menos 3 caracteres.

# Unit_Name_MaxLength
source: The unit name must have at most 255 characters.
pt_br: O nome da unidade deve ter no máximo 255 caracteres.

# User_Email_AlreadyExists
source: A user with this email already exists.
pt_br: Já existe um usuário com este e-mail.

source: User not found.
pt_br: Usuário não encontrado.

# User_Password_Required
source: Password is required.
pt_br: A senha é obrigatória.

# User_Email_Required
source: Email is required.
pt_br: O e-mail é obrigatório.

# User_Email_Invalid
source: The email format is invalid.
pt_br: O formato do e-mail é inválido.

# User_Inactive
source: Inactive user. Please contact the administrator.
pt_br: Usuário inativo. Contate o administrador.

# User_Password_Invalid
source: Invalid password. Please check your credentials.
pt_br: Senha inválida. Verifique suas credenciais.

# User_Role_Invalid
source: The role must start with a letter and may contain letters, numbers, or underscores (max 50 characters).
pt_br: O papel deve começar com uma letra e pode conter letras, números ou underscore (máx. 50 caracteres).

# Tenant_Subdomain_Invalid
source: The subdomain must contain only lowercase letters, numbers, and hyphens (cannot start or end with hyphen).
pt_br: O subdomínio deve conter apenas letras minúsculas, números e hífens (sem começar ou terminar com hífen).

# Tenant_Subdomain_AlreadyExists
source: This subdomain is already in use.
pt_br: Este subdomínio já está em uso.

# Tenant_Header_Required
source: Provide the X-Tenant header with the tenant subdomain.
pt_br: Informe o header X-Tenant com o subdomínio do tenant.

# Tenant_Header_InvalidFormat
source: The X-Tenant header value is invalid. Use lowercase letters, numbers, and hyphens only.
pt_br: O valor do header X-Tenant é inválido. Use apenas letras minúsculas, números e hífens.

# Tenant_Header_MissingClaim
source: The JWT token does not include the tenant claim.
pt_br: O token JWT não contém a claim de tenant.

# Tenant_Header_Mismatch
source: The tenant from the token does not match the X-Tenant header.
pt_br: O tenant do token não corresponde ao informado no header X-Tenant.

# Auth_SignUp_Success
source: Sign-up completed successfully.
pt_br: Cadastro realizado com sucesso.

# Auth_Refresh_InvalidOrExpired
source: The refresh token is invalid or has already expired.
pt_br: O refresh token é inválido ou já expirou.
